&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.Фильтр = "XML-файлы (*.xml)|*.xml";
    ДиалогВыбораФайла.МножественныйВыбор = Ложь;
    
    Если ДиалогВыбораФайла.Выбрать() Тогда
        ФайлXML = ДиалогВыбораФайла.ПолноеИмяФайла;
    	ПутьКФайлу = ФайлXML;
	КонецЕсли;
КонецПроцедуры
/////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Читать(Команда)  
	ПрочитатьXMLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьXMLНаСервере()
    // Открываем XML файл для чтения
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьКФайлу);

    // Перемещаемся к первому узлу в XML-файле
    Пока ЧтениеXML.Прочитать() Цикл
        Если ЧтениеXML.ЭтоУзел() Тогда
            Если ЧтениеXML.Имя = "Customer" Тогда
                НоваяСтрока = ТЧ.Добавить();
                
                // Читаем атрибуты или дочерние элементы
                Пока ЧтениеXML.Прочитать() И Не ЧтениеXML.ЭтоКонецУзла() Цикл
                    Если ЧтениеXML.ЭтоУзел() Тогда
                        Если ЧтениеXML.Имя = "CompanyName" Тогда
                            НоваяСтрока.Наименование = ЧтениеXML.ПрочитатьТекст();
                        ИначеЕсли ЧтениеXML.Имя = "Phone" Тогда
                            НоваяСтрока.Контакты = ЧтениеXML.ПрочитатьТекст();
                        КонецЕсли;
                    КонецЕсли;
                КонецЦикла;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    // Закрываем файл после чтения
    ЧтениеXML.Закрыть();
КонецПроцедуры  

Функция ПреобразоватьXMLвТЗ(СтрокаXML, СхемаПреобразования);
	
	ПроцессорПреобразования = Новый ПреобразованиеXSL;
	ПроцессорПреобразования.ЗагрузитьИзСтроки(СхемаПреобразования);
	РезультатПреобразованияXML = ПроцессорПреобразования.ПреобразоватьИзСтроки(СтрокаXML);
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(РезультатПреобразованияXML);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	Возврат ТЗ;
	
КонецФункции
