
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	ПараметрДатаОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчета");
//	Если ПараметрДатаОтчета <> Неопределено Тогда
//		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДатаОтчета.ИдентификаторПользовательскойНастройки);
//		Если Элемент <> Неопределено И Элемент.Использование Тогда
//			ЗначениеДатаОтчета = Элемент.Значение;
//		КонецЕсли;	
//	КонецЕсли;
//	
//	Если ЗначениеДатаОтчета <> Неопределено Тогда		
//		
//		ПараметрПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
//		Если ПараметрПериод <> Неопределено Тогда			
//			ПараметрПериод.Использование = Истина;
//			Если ЗначениеДатаОтчета.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата Тогда
//				ПараметрПериод.Значение = НачалоДня(ЗначениеДатаОтчета.Дата + 24*3600);
//			Иначе
//				ПараметрПериод.Значение = ЗначениеДатаОтчета.Дата;
//			КонецЕсли;			
//		КонецЕсли;
//				
//	КонецЕсли;
//	
//		
//КонецПроцедуры
