
&НаКлиенте
Процедура ПоказатьСодержимоеФайла(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Текстовый документ (*.txt) | *.txt";
	
	ЧтоДелатьПосле = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог.Показать(ЧтоДелатьПосле);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ПутьКФайлу;
	Сообщение.Сообщить();
	
КонецПроцедуры
